# # Завдання 1.
# # 1. Створіть два будь-яких кортежі і зв'яжіть їх із змінними.
# # 2. Виведіть загалом кількість елементів у обидвох цих кортежах.
# # 3. Вийміть з першого кортежу другий елемент і виведіть його.
# # 4. Візьміть з другого кортежу  три останні елементи і виведіть їх.
# # 5. З'єднайте обидва кортежі в один, присвоївши результат новій змінній. Виведіть отриманий кортеж на екран.
# # 6. Розпакуйте перші три елементи отриманого кортежу у змінні x, y та z. Виведіть x, y, z.
# # 7. Виконайте swap змінних x та z.
#
# tup1 = ('python', 'jango', 'OOП', 'HTML')
# tup2 = ('CSS', 2, [1, 2, 3], {'python', 'jango', 'OOП', 'HTML'})
# print(f'Загалом кількість елементів у обидвох кортежах = {len(tup1) + len(tup2)}')
# elem2_tup1 = tup1[1]
# print(elem2_tup1)
# print(tup2[1:])
# tup1_tup2 = tup1 + tup2
# print(tup1_tup2)
# x, y, z, *_ = tup1_tup2
# print(x, y, z)
# x, y = y, x

# # Завдання 2.
# # Заданий список
# # lst = ["apple", "banana", "cherry", "orange", "kiwi", "melon", "mango"].
# # Посортовувати список lst і перетворити його у кортеж tpl.
# # Із кортежу tpl cтворіть і виведіть кортеж temp, що містить тільки елементи довжини 5.
#
# lst = ["apple", "banana", "cherry", "orange", "kiwi", "melon", "mango"]
# sort_lst = sorted(lst)
# tup = tuple(sort_lst)
# temp = tuple(item for item in tup if len(item) == 5)
# print(*temp)

# # Завдання 3.
# # Для введеної  або згенерованої рандомно послідовності цілих додатних чисел, вивести їх
# # у кортежі так, щоб парні елементи розташовувалися за зростанням на початку, а непарні за
# # спаданням - в кінці
#
# from random import randint, seed
# seed(11)
#
# rando = tuple(randint(1,100) for _ in range(40))
# number_guy = sorted(tuple(item for item in rando if item % 2 == 0))
# unpaired_numbers = sorted(tuple(item for item in rando if item % 2 != 0), reverse=True)
# result_tuple = tuple(number_guy + unpaired_numbers)
# print(result_tuple)
#
#
# # рішення в одну строку
# print(tuple(sorted(tuple(item for item in rando if item % 2 == 0)) + sorted(tuple(item for item in rando if item % 2 != 0), reverse=True)))

# # Завдання 1
# # Задайте два кортежі цілих чисел:
# # tuple1 = ['b', 'a', 'd', 'b', 'a', 'd', 'h', 'g']
# # tuple2 = ['g', 'b', 'e', 'c', 'a', 'b', 'h', 'b']
# # 1.	Знайдіть елементи, які присутні у першому або другому кортежах.
# # 2.	Знайдіть спільні елементи, які містяться одночасно в обох кортежах.
# # 3.	Знайдіть елементи, які не містяться одночасно в обох кортежах.
# # 4.	Знайдіть елементи, які містяться у другому кортежі, але не містяться у першому.
# # 5.	Знайдіть елементи, які унікальні для першого кортежу, тобто елементи, які не повторюються.
# # 6.	Знайдіть елементи, які є в кожному з кортежів і знаходяться в кожному з них на тій самій позиції.
#
# # Примітка. Для пунктів 1-4 цикли не використовуємо.
# tuple1 = ['b', 'a', 'd', 'b', 'a', 'd', 'h', 'g']
# tuple2 = ['g', 'b', 'e', 'c', 'a', 'b', 'h', 'b']
#
# print(set(tuple1) & set(tuple2))	# 1. Знайдіть елементи, які присутні у першому або другому кортежах.
# print(set(tuple1) | set(tuple2))    # 2.	Знайдіть спільні елементи, які містяться одночасно в обох кортежах.
# print(set(tuple1) ^ set(tuple2))    # 3.	Знайдіть елементи, які не містяться одночасно в обох кортежах.
# print(set(tuple2) -  set(tuple1))   # 4.	Знайдіть елементи, які містяться у другому кортежі, але не містяться у першому.
# print([item for item in tuple1 if tuple1.count(item) == 1]) # 5.	Знайдіть елементи, які унікальні для першого кортежу, тобто елементи, які не повторюються.
#
# lst = []                            # 6.	Знайдіть елементи, які є в кожному з кортежів і знаходяться в кожному з них на тій самій позиції.
# for i in range(len(tuple1)):
#     if tuple1[i] == tuple2[i]:
#         lst.append(tuple1[i])
# print(lst)

# # Завдання 2.
# # Вводиться рядок слів через пробіл.
# # Вивести різні слова у введеному рядку та їх кількість.
# # Визначте, скільки задіяно різних букв у введеному рядку.
#
# data = input('Введіть рядок слів через пробіл: ').lower().split()
#
# print(f'''Різні слова у введеному рядку: {set(data)}
# Кількість слів = {len(set(data))}''')
#
# lst = [[char for char in word] for word in data] #[['P', 'y', 't', 'h', 'o', 'n'], ['C', 'S', 'S'], ['H', 'T', 'M', 'L'], ['J', 'a', 'n', 'g', 'o'], ['О', 'О', 'П'], ['H', 'T', 'M', 'L'], ['P', 'y', 't', 'h', 'o', 'n', '_', '3', '.', '1', '1']]
# flattened_list = [item for sublist in lst for item in sublist] #['P', 'y', 't', 'h', 'o', 'n', 'C', 'S', 'S', 'H', 'T', 'M', 'L', 'J', 'a', 'n', 'g', 'o', 'О', 'О', 'П', 'H', 'T', 'M', 'L', 'P', 'y', 't', 'h', 'o', 'n', '_', '3', '.', '1', '1']
# print(f'У введеному рядку задіяно {len(set(flattened_list))} різних букв')

# Завдання 3.
# Маємо множину з назвами країн. Надайте користувачеві можливість через пункти меню:
# ■ додавати країни;
# ■ видаляти країни;
# ■ пошук країн за введеними символами;
# ■ перевіряти, чи міститься введена країна в множині.

countries = {"Ukraine", "USA", "Canada", "Germany", "France", "France1", "France",}

print("Меню:")
print("1. Додати країну")
print("2. Видалити країну")
print("3. Здійснити пошук країн за введеними символами")
print("4. Перевіряти, чи міститься введена країна в множині")

res = int(input('Введіть цифру: '))

if res == 1:
    res1 = list(input('Введіть назву країни або країн, які хочете додати: ').split())
    countries.update(res1)

if res == 2:
    res2 = input('Введіть назву країни, яку хочете видалити: ')
    countries.remove(res2)

if res == 3:
    lis = []
    res3 = input('Введіть символи: ')
    for item in countries:
        if res3 in item:
            lis.append(item)
    print(f'За введеними симаолами {res3} знайдено країну {lis}')

if res == 4:
    res4 = input('Введіть назву країни: ')
    for item in countries:
        if res4 == item:
            print(f'Країна {res4} присутня у множні')


#






