# # Завдання 1.
# # 1. Створіть два будь-яких кортежі і зв'яжіть їх із змінними.
# # 2. Виведіть загалом кількість елементів у обидвох цих кортежах.
# # 3. Вийміть з першого кортежу другий елемент і виведіть його.
# # 4. Візьміть з другого кортежу  три останні елементи і виведіть їх.
# # 5. З'єднайте обидва кортежі в один, присвоївши результат новій змінній. Виведіть отриманий кортеж на екран.
# # 6. Розпакуйте перші три елементи отриманого кортежу у змінні x, y та z. Виведіть x, y, z.
# # 7. Виконайте swap змінних x та z.
#
# tup1 = ('python', 'jango', 'OOП', 'HTML')
# tup2 = ('CSS', 2, [1, 2, 3], {'python', 'jango', 'OOП', 'HTML'})
# print(f'Загалом кількість елементів у обидвох кортежах = {len(tup1) + len(tup2)}')
# elem2_tup1 = tup1[1]
# print(elem2_tup1)
# print(tup2[1:])
# tup1_tup2 = tup1 + tup2
# print(tup1_tup2)
# x, y, z, *_ = tup1_tup2
# print(x, y, z)
# x, y = y, x

# Завдання 2.
# Заданий список
# lst = ["apple", "banana", "cherry", "orange", "kiwi", "melon", "mango"].
# Посортовувати список lst і перетворити його у кортеж tpl.
# Із кортежу tpl cтворіть і виведіть кортеж temp, що містить тільки елементи довжини 5.

lst = ["apple", "banana", "cherry", "orange", "kiwi", "melon", "mango"]
sort_lst = sorted(lst)
tup = tuple(sort_lst)
temp = tuple(item for item in tup if len(item) == 5)
print(type(temp))
print(*temp)



