# 1 task
# Напишіть програму «Книги». Створіть два списки з даними. Один список зберігає назви книг, другий — роки випуску.
# Реалізуйте меню для користувача:
# ■ відсортувати за назвою книг в алфавітному порядку;
# ■ відсортувати за рокам випуску за спаданням;
# ■ вивести список книг з назвами та роками випуску;
# ■ вихід.
#
# При сортуванні не використовувати готові рішення для списків як метод sort() та функцію sorted.
# При виводі вказати який спосіб сортування було реалізовано і використано.

# print('          *****«Книги»*****     ')
# print()
## book_titles = list(map(str, input('Введіть перелік книг через пробіл: ').split()))
## years_written = list(map(int, input('Введіть рік випуску книг через пробіл: ').split()))
# print()
# print('''          *****Виберіть операцію*****
# 1 - відсортувати за назвою книг в алфавітному порядку;
# 2 - відсортувати за рокам випуску за спаданням;
# 3 - вивести список книг з назвами та роками випуску;
# 4 - вихід''')
# print()
# result_selection = int(input('Виберіть операцію, цифру від 1 до 4: '))
# print()
#
# book_titles = ["Жотий князь",
#                "Убити пересмішника",
#                "Великий Гетсбі",
#                "Майстер і Маргарита",
#                "Маленькі жінки",
#                "Гаррі Поттер і філософський камінь",
#                "Той, хто біжить по лезу",
#                "Прокляття чорної перлини",
#                "Тихий Дон",
#                "Вбивство у Східному експресі"
#                ]
#
# years_written = [1961, 1960, 1925, 1938, 1868, 1997, 1968, 2003, 1928, 1934]
# lst = []
#
# if result_selection == 1:
#     for run in range(len(book_titles) - 1):
#         for i in range(len(book_titles) - 1):
#             if ord(book_titles[i][0]) > ord(book_titles[i + 1][0]):
#                 book_titles[i], book_titles[i + 1] = book_titles[i + 1], book_titles[i]
#     print(f'Відсортувані за назвою книг в алфавітному порядку: {book_titles}')
#
#
# if result_selection == 2:
#     for run in range(len(years_written) - 1):
#         for i in range(len(years_written) - 1):
#             if years_written[i] < years_written[i + 1]:
#                 years_written[i], years_written[i + 1] = years_written[i + 1], years_written[i]
#     print(f'Відсортуваний список за роками випуску за спаданням: {years_written}')
#
#
# if result_selection == 3:
#     for i in range(len(book_titles)):
#         lst.append([book_titles[i], years_written[i]])
#
# for i in lst:
#     print(f'Книга "{i[0]}" написана у {i[1]} році')
#
# if result_selection == 4:
#     print('Кінець')

# 2 task
# Напишіть програму для сортування списку методом удосконаленого бульбашкового сортування за спаданням
# Удосконалення полягає в тому, щоб аналізувати кількість перестановок на кожному кроці.
# Якщо ця кількість дорівнює нулю, то продовжувати сортування немає сенсу — список відсортовано.

lst = [1961, 1960, 1925, 1938, 1997, 1968, 2003, 1928, 1934]
count = 0
for run in range(len(lst) - 1):
    count = 0
    for i in range(len(lst) - 1 - run):
        if lst[i] < lst[i + 1]:
            lst[i + 1], lst[i] = lst[i], lst[i + 1]
            count+=1

    if count==0:
        break

print(lst)
